In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Combine two Series objects

In [2]:
s1 = pd.Series(['A', 'B', 'C'], index=[0, 1, 2])
s2 = pd.Series(['D', 'E', 'F'], index=[3, 4, 5])
s12=pd.concat([s1, s2])
s12

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [3]:
# if we do not set index ..
s1 = pd.Series(['A', 'B', 'C'])
s2 = pd.Series(['D', 'E', 'F'])
s12=pd.concat([s1, s2])
s12

0    A
1    B
2    C
0    D
1    E
2    F
dtype: object

In [4]:
s12[0] # an index -> two values, this is weird...

0    A
0    D
dtype: object

## Concatenate Two Dataframe Objects

In [5]:
Matrix = [[1, 2],
          [3, 4],
          [5, 6]]
df1 = pd.DataFrame(Matrix, columns=['A', 'B'], index=[0, 1, 2]) 
df2 = pd.DataFrame(Matrix, columns=['C', 'D'], index=[3, 4, 5])

In [6]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [7]:
df2

   C  D
3  1  2
4  3  4
5  5  6

In [8]:
df12=pd.concat([df1, df2], axis=0)
df12

     A    B    C    D
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
2  5.0  6.0  NaN  NaN
3  NaN  NaN  1.0  2.0
4  NaN  NaN  3.0  4.0
5  NaN  NaN  5.0  6.0

see the next example

In [9]:
Matrix = [[1, 2],
          [3, 4],
          [5, 6]]
df1 = pd.DataFrame(Matrix, columns=['A', 'B'], index=[0, 1, 2]) 
df2 = pd.DataFrame(Matrix, columns=['C', 'D'], index=[0, 4, 5])

In [10]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [11]:
df2

   C  D
0  1  2
4  3  4
5  5  6

In [12]:
df12_concat0 = pd.concat([df1, df2], axis=0)
df12_concat0

     A    B    C    D
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
2  5.0  6.0  NaN  NaN
0  NaN  NaN  1.0  2.0
4  NaN  NaN  3.0  4.0
5  NaN  NaN  5.0  6.0

In [13]:
df12_concat1 = pd.concat([df1, df2], axis=1)
df12_concat1

     A    B    C    D
0  1.0  2.0  1.0  2.0
1  3.0  4.0  NaN  NaN
2  5.0  6.0  NaN  NaN
4  NaN  NaN  3.0  4.0
5  NaN  NaN  5.0  6.0

In [14]:
#a potential solution is to change index of df2
df1 = pd.DataFrame(Matrix, columns=['A', 'B'], index=[0, 1, 2]) 
df2 = pd.DataFrame(Matrix, columns=['C', 'D'], index=[0, 1, 2])

In [15]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [16]:
df2

   C  D
0  1  2
1  3  4
2  5  6

In [17]:
df12_concat0 = pd.concat([df1, df2], axis=0)
df12_concat0

     A    B    C    D
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
2  5.0  6.0  NaN  NaN
0  NaN  NaN  1.0  2.0
1  NaN  NaN  3.0  4.0
2  NaN  NaN  5.0  6.0

In [18]:
df12_concat0 = pd.concat([df1, df2], axis=1)
df12_concat0

   A  B  C  D
0  1  2  1  2
1  3  4  3  4
2  5  6  5  6

see the next example <br>
both df1 and df2 have the column index 'A'

In [19]:
Matrix = [[1, 2],
          [3, 4],
          [5, 6]]
df1 = pd.DataFrame(Matrix, columns=['A', 'B'], index=[0, 1, 2]) 
df2 = pd.DataFrame(Matrix, columns=['A', 'D'], index=[3, 4, 5])

In [20]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [21]:
df2

   A  D
3  1  2
4  3  4
5  5  6

In [22]:
df12_concat0 = pd.concat([df1, df2], axis=0)
df12_concat0

   A    B    D
0  1  2.0  NaN
1  3  4.0  NaN
2  5  6.0  NaN
3  1  NaN  2.0
4  3  NaN  4.0
5  5  NaN  6.0

In [23]:
df12_concat1 = pd.concat([df1, df2], axis=1)
df12_concat1

     A    B    A    D
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
2  5.0  6.0  NaN  NaN
3  NaN  NaN  1.0  2.0
4  NaN  NaN  3.0  4.0
5  NaN  NaN  5.0  6.0

the above table is weird: two columns named A

In [24]:
df12_merge= pd.merge(df1, df2)
df12_merge

   A  B  D
0  1  2  2
1  3  4  4
2  5  6  6

In [25]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [26]:
df2

   A  D
3  1  2
4  3  4
5  5  6

see this one

In [27]:
Matrix1 = [[1, 2],
           [3, 4],
           [5, 6]]
Matrix2 = [[10, 20],
           [30, 40],
           [50, 60]]
df1 = pd.DataFrame(Matrix1, columns=['A', 'B'], index=[0, 1, 2]) 
df2 = pd.DataFrame(Matrix2, columns=['A', 'D'], index=[3, 4, 5])

In [28]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [29]:
df2

    A   D
3  10  20
4  30  40
5  50  60

In [30]:
df12_merge= pd.merge(df1, df2)
df12_merge

Empty DataFrame
Columns: [A, B, D]
Index: []

### Merge two dataframe objects using `pd.merge`
if some column indexes of two dataframes are the same, try to use pd.merge

In [31]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [32]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'], 
                    'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [33]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [34]:
df_weird = pd.concat([df1, df2], axis=0, sort=False)
df_weird

  employee        group  hire_date
0      Bob   Accounting        NaN
1     Jake  Engineering        NaN
2     Lisa  Engineering        NaN
3      Sue           HR        NaN
0     Lisa          NaN     2004.0
1      Bob          NaN     2008.0
2     Jake          NaN     2012.0
3      Sue          NaN     2014.0

In [35]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [36]:
df3 # df3 is pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df3 and df4 have the column index 'group' <br>
the 'group' columns in df3 an df4 are called key-columns  <br>
pandas will merge df3 an df4 by the key-columns

In [37]:
df34 = pd.merge(df3, df4)
df34

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve